#这个文件是操作数据的函数接口

#初始化数据库
def init_data():
    return
#########################################   movie   ###################################################
#电影表结构（最好不要更改名字！！~~）
'''
* 下面是最好有的部分，以id为键。（用于推荐和内容简介）
* 感觉还可以有两项：情节介绍、图片，待添加
* 其中crew这一列的格式为 “$职责：$姓名,$职责：$姓名...”

table movie
+----+-------------------+----------------------------------+-------------------+----------+--------+------------+--------------+
| id | title             | cast                             | crew              | keywords | genres | vote_count | vote_average |
+----+-------------------+----------------------------------+-------------------+----------+--------+------------+--------------+
|  1 | Hi!Li Huanying    | Jia Ling,Shen Teng,Zhang Xiaofei | Director:Jia Ling |          |        |     888501 |          8.1 |
|  2 | Kill Novel Writer | Lei Jiayin,Yang Mi,Dong Zijian   | Director:Lu Yang  |          |        |     348011 |            7 |
|  3 | XiHongShi Shoufu  | Shen Teng                        | Director:Yan Fei  |          |        |     862512 |          6.6 |
+----+-------------------+----------------------------------+-------------------+----------+--------+------------+--------------+

'''

#向电影表中添加一条电影记录
def add_movie():
    return

#删除
def delete_movie():
    return 


#######################################   user  #############################################################
#user表
'''
* recommend项的值是电影的id组成的列表,表示用户的推荐
* browsing_records项表示用户看过的电影

table user
+----+-------------------+----------------------------------+-------------------+--------------------+
| id | mail              | keyword                          | recommend         | browsing_records   |
+----+-------------------+----------------------------------+-------------------+--------------------+
|  1 | 1@1.com           | 12345                            | 1,3,5,6           | 1,2,3,4,5,6,7      |
+----+-------------------+----------------------------------+-------------------+--------------------+

'''
#用户注册
def user_regist():
    return

#登录
def user_signin():
    return

#上传推荐列表():
def user_upload_recommend():
    return

#增加浏览记录时，更新browsing_records
#由于不是同步更新，而是将一段时间缓存的历史读入，第二个参数应该是接收一个列表
def add_browsing_records(userid, movie_list):
    return


#######################################  评分  #####################################################################
#评分表
'''
* 希望用户对看过的电影进行评分，这张表只需要记录所有的评分记录就可以了 (名字最好不要改动~) 
* comment不是必要的，可以加上让用户添加评语
* 评分可以是小数，取值0~10

table rating
+--------+-------------------+----------------------------------+-------------------+
| userId | movieId           | rating                           | comment           |    
+--------+-------------------+----------------------------------+-------------------+
|  1     | 2                 | 5.3                              | good~！           |
+--------+-------------------+----------------------------------+-------------------+

'''

#记录 用户的一次打分
def record_rating():
    return